// 1) Automatic checking - no restart required
"UPDATES_AVAILABLE_NO_RESTART_MESSAGE" = "Estão disponíveis actualizações do software para o seu computador. Gostaria de as instalar?";
"UPDATES_AVAILABLE_NO_RESTART_INFORMATIVE" = "Pode continuar a utilizar o computador durante a instalação. Uma vez concluída a instalação, não será necessário reiniciar o computador.";
"INSTALL_TITLE" = "Instalar";

// 2) Automatic checking - restart required, already downloaded
"UPDATES_AVAILABLE_INSTALL_MESSAGE" = "As actualizações de software para o seu computador estão prontas para serem instaladas. Gostaria de as instalar agora?";

"UPDATES_AVAILABLE_INSTALL_AND_RESTART_INFORMATIVE" = "Tem de reiniciar o computador depois de instalar as actualizações.";
"LOG_OUT_AND_INSTALL_AND_RESTART_TITLE" = "Instalar e reiniciar";

"UPDATES_AVAILABLE_INSTALL_AND_LOG_OUT_INFORMATIVE" = "Para instalar as actualizações, tem de terminar sessão.";
"LOG_OUT_AND_INSTALL_TITLE" = "Terminar sessão e instalar";

"UPDATES_AVAILABLE_INSTALL_AND_SHUTDOWN_INFORMATIVE" = "Tem de desligar o computador depois de instalar as actualizações.";
"LOG_OUT_AND_INSTALL_AND_SHUTDOWN_TITLE" = "Instalar e desligar";

// 3) Automatic checking - Restart / Log out / Shut Down required, need to download
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_MESSAGE" = "Estão disponíveis actualizações de software para o seu computador. Gostaria de as descarregar e instalar?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_INFORMATIVE" = "Tem de reiniciar o computador depois de instalar as actualizações.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_MESSAGE" = "Estão disponíveis actualizações de software para o seu computador. Gostaria de as descarregar e instalar?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_INFORMATIVE" = "Tem de terminar sessão depois de descarregar as actualizações.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_MESSAGE" = "Estão disponíveis actualizações de software para o seu computador. Gostaria de as descarregar e instalar?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_INFORMATIVE" = "Tem de desligar o computador depois de instalar as actualizações.";

"CONTINUE_TITLE" = "Continuar";


// common buttons
"NOT_NOW_TITLE" = "Agora não";
"SHOW_DETAILS_TITLE" = "Mostrar detalhes";
